Repository: BuiHuyPhuoc/HotelManager
Catalog: booking_hotel/lib/l10n/app_*.arb
Languages: vi

source: Hello World!
vi: Xin chào thế giới!

# userNotFound
source: User is not found!
vi: Không tìm thấy người dùng!

source: Welcome back!
vi: Chào mừng!

# pleaseInputField
source: Please fill in {message} field!
vi: Vui lòng điền vào ô {message}!

# userInfo
source: {info, select, email{Email} password{Password} fullName{Full name} dateOfBirth{Date of birth} phoneNumber{Phone number} id{Identification} other{orther}}
vi: {info, select, email{Email} password{Mật khẩu} fullName{Họ tên} dateOfBirth{Ngày sinh} phoneNumber{Số điện thoại} id{Số định danh} other{orther}}

# choice
source: {choices, select, cancel{Cancel} accept{Accept} other{Other}}
vi: {choices, select, cancel{Huỷ} accept{Chấp nhận} other{Other}}

source: Sign up here!
vi: Đăng ký tại đây!

source: Forgot password?
vi: Quên mật khẩu?

source: Sign In
vi: Đăng nhập

source: Sign Up
vi: Đăng ký

source: Sign in with
vi: Đăng nhập với

source: Don''t have account?
vi: Chưa có tài khoản?

# agreeTerms
source: I agree to the terms and services.
vi: Tôi đồng ý với các điều khoản và dịch vụ.

# haveAccount
source: Already have an account?
vi: Đã có tài khoản?

# pleaseAgreeTerms
source: Please agree with the terms and services!
vi: Vui lòng chấp nhận các điều khoản và dịch vụ.

source: Sign up success.
vi: Tạo tài khoản thành công

# navigationTo
source: Go to {page} page?
vi: Đến trang {page}?

# homePage
source: Home
vi: Trang chủ

# allPage
source: All
vi: Tất cả

# favoritePage
source: Favorite
vi: Yêu thích

# settingPage
source: Setting
vi: Cài đặt

# homePageLogan1
source: From ever
vi: Ở mọi nơi

# homePageLogan2
source: Where you go!
vi: Mà bạn tới!

# pressAgainToExit
source: Press back again to exit!
vi: Ấn quay về một lần nữa để thoát!

# bestHotelLabel
source: Best from each hotel
vi: Tốt nhất của từng khách sạn

# currentSale
source: Current sale rooms
vi: Các phòng đang giảm giá

# likeVote
source: likes
vi: lượt

source: All
vi: Tất cả

source: Hotel
vi: Khách sạn

source: City
vi: Thành phố

source: By hotel
vi: Theo khách sạn

source: By city
vi: Theo thành phố

# toManageAccount
source: To manage your account!
vi: Để quản lý tài khoản của bạn!

source: Dark mode
vi: Chế độ nền tối

# roomDetailLabel
source: About the room
vi: Thông tin phòng

# likeRoom
source: Like this room?
vi: Thêm vào yêu thích?

# likedRoom
source: Liked
vi: Đã thích

source: Description
vi: Mô tả phòng

source: Amenities
vi: Tiện nghi

source: day
vi: ngày

source: book now
vi: đặt ngay

# requiredLogin
source: You must login first
vi: Bạn phải đăng nhập trước.

source: Booking Detail
vi: thông tin đơn đặt

source: hour
vi: giờ

source: hotel address
vi: địa chỉ khách sạn

# idRoom
source: room number
vi: số phòng

# priceTotal
source: total
vi: tổng cộng

# clickToLogin
source: click here to login
vi: Ấn vào đây để đăng nhập

# bookingSubmit
source: submit
vi: xác nhận đặt

# warningBookedRoom
source: room''s already booked
vi: phòng đã được đặt

# warningDateInvalid
source: Choose the checkin and checkout day
vi: chưa chọn ngày

# bookingSucess
source: sucessful booking
vi: đặt phòng thành công

# subBookingSuccess
source: We already save your booking room.
vi: chúng tôi đã lưu đơn đặt của bạn.

source: Booking Rooms
vi: Các đơn đặt

# bookingStatus
source: {ty, select, Unpaid{Unpaid} Paid{Paid} Cancelled{Cancelled} other{Other}}
vi: {ty, select, Unpaid{Chưa trả} Paid{Hoàn tất} Cancelled{Đã huỷ} other{Other}}

source: cancel ticket
vi: Huỷ vé

source: undo ticket
vi: Phục hồi vé đã huỷ

source: view ticket
vi: Xem vé

# cusInfomation
source: customer information
vi: thông tin khách hàng

# bookingInfomation
source: booking information
vi: Thông tin đơn đặt

source: booking date
vi: ngày đặt

# updateRoomStatusSuccess
source: Update room status successfully
vi: Cập nhật trạng thái thành công

source: logout
vi: đăng xuất

# logoutWarning
source: do you want to logout?
vi: bạn có muốn đăng xuất?

source: notification
vi: thông báo

source: security
vi: bảo mật

source: help
vi: trợ giúp

source: update profile
vi: cập nhật thông tin

source: lost internet connection
vi: mất kết nối internet

# checkInternetConnection
source: Check internet connection and try later.
vi: vui lòng kiểm tra lại đường truyền và thử lại sau

source: Booked room
vi: Phòng đã đặt

source: You don''t have any booked room.
vi: Bạn chưa có đơn đặt phòng nào.

# backButton
source: Turn Back
vi: Quay trở về

source: Choose payment method
vi: Chọn phương thức thanh toán.

# successPayment
source: Payment was successful.
vi: Thanh toán thành công.

# failPayment
source: Payment was fail.
vi: Thanh toán thất bại.

# featureIsUpdating
source: This feature is updating.
vi: Tính năng đang được cập nhật.

# errorWarning
source: Some errors occured.
vi: Có lỗi xuất hiện.

# amenity
source: {name, select, WIFI{wifi} PARKING{parking} RESTAURANT{restaurant} POOL{pool} BEDROOM{bedroom} other{error}}
vi: {name, select, WIFI{wifi} PARKING{đậu xe} RESTAURANT{nhà hàng} POOL{hồ bơi} BEDROOM{phòng ngủ} other{lỗi}}

# bookingType
source: {Type, select, canCheckIn{Can checkin} canCheckOut{Can checkout} full{Full} other{error}}
vi: {Type, select, canCheckIn{Có thể checkin} canCheckOut{Có thể checkout} full{Full} other{error}}

source: Sign
vi: Kí hiệu
